docs/arkitektur/tilstander/NAV 04-01.04.approved.md
```mermaid
   stateDiagram
   [*]-->MottattType
   	MottattType --> AvventerJournalpostType
	AvventerJournalpostType --> AvventerPersondataType
	AvventerPersondataType --> KategoriseringType
	KategoriseringType --> AvventerSøknadsdataType
	AvventerSøknadsdataType --> AvventerMinsteinntektVurderingType
	AvventerMinsteinntektVurderingType --> AvventerSvarOmEksisterendeSakerType
	AvventerSvarOmEksisterendeSakerType --> AventerArenaStartVedtakType
	AventerArenaStartVedtakType --> AvventerFerdigstillJournalpostType
	AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
   InnsendingFerdigstiltType--> [*]    
```
